soccercollection_app_api/app/controllers/players_controller.rb

INSERT INTO "players" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Drogba"], ["age", 39], ["created_at", "2020-07-11 14:43:35.905867"], ["updated_at", "2020-07-11 14:43:35.905867"]]
---
  def create
    @player = Player.new(player_params)

    if @player.save

DELETE FROM "players" WHERE "players"."id" = $1  [["id", 3]]
---
  def destroy
    @player.destroy